Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: Token
es: Identificador

source: Syntax
es: Sintaxis

source: Reference
es: Referencia

source: assignment operators
es: Operadores de Asignación

source: array(), array syntax
es: array(), Sintaxis de array

source: type-casting
es: Forzado de Tipos

# anything below ASCII 32 except (0x09), (0x0a) and (0x0d)
source: anything below ASCII 32 except \t (0x09), \n (0x0a) and \r (0x0d)
es: cualquier caracter debajo del ASCII 32, excepto \t (0x09), \n (0x0a) y \r (0x0d)

source: logical operators
es: Operadores Lógicos

source: (bool) or (boolean)
es: (bool) o (boolean)

source: classes and objects
es: Clases y Objetos

source: ? or%
es: ? o%

source: / / or #
es: / / o #

source: comments
es: Comentarios

source: "foo" or'bar '
es: "foo" o 'bar '

source: string syntax
es: Sintasis de Cadenas

source: incrementing / decrementing operators
es: Operadores de Incremento / decremento

source: floating point numbers
es: Números en Punto Flotante

source: complex variable parsed syntax
es: Sintaxis de Variables Complejas Analizadas

source: array syntax
es: Sintaxis de Arreglos

source: declare, alternative syntax
es: declare, Sintaxis Alternativa

source: for, alternative syntax
es: for, Sintaxis Alternativa

source: foreach, alternative syntax
es: foreach, Sintaxis Alternativa

source: if, alternative syntax
es: if, Sintaxis Alternativa

source: switch, alternative syntax
es: switch, Sintaxis Alternativa

source: while, alternative syntax
es: while, Sintaxis Alternativa

source: heredoc syntax
es: heredoc

source: exit or die
es: exit o die

source: extends, classes and objects
es: extends, Clases y Objetos

source: constants
es: Constantes

source: function or cfunction
es: function o cfunction

source: functions
es: Funciones

source: variable scope
es: Ambito de Variables

source: (int) or (integer)
es: (int) o (integer)

source: comparison operators
es: Operadores de Comparación

source: != or
es: != o

source: integers
es: Enteros

source: /* and * /
es: /* y * /

source: ?php,? or%
es: ?php,? o%

source: escaping from HTML
es: Saliendo de HTML

source: ?= or %=
es: ?= o %=

source: returning values
es: Retorno de Valores

source: bitwise operators
es: Operadores a Nivel de Bits

source: (not documented; casts to NULL)
es: (no documentado; arroja a NULL)

source: (not implemented)
es: (no implementado)

source: constants, since PHP 4.3.0
es: constants, desde PHP 4.3.0

source: Chapter 2.
es: Capítulo 2.

source: Example 2-1.
es: Ejemplo 2-1.

source: Example 2-6.
es: Ejemplo 2-6.

source: Example 2-7.
es: Ejemplo 2-7.

source: Example 2-2.
es: Ejemplo 2-2.

source: Example 2-3.
es: Ejemplo 2-3.

source: Example 2-4.
es: Ejemplo 2-4.

source: Example 2-5.
es: Ejemplo 2-5.

source: Installation
es: Instalación

source: Appendix I.
es: Apéndice I.

source: List of Parser Tokens
es: Lista de Identificadores (tokens) del Analizador

source: A set of macros was introduced into Zend' s API that simplify access to zval containers (see Table 42-1).
es: A set of macros was introduced into Zend' s API that simplify access to zval containers (see Tabla 42-1).

source: Table 42-1.
es: Tabla 42-1.

source: Chapter 32.
es: Capítulo 32.

source: To work around this, you have to use a set of API functions to force a type conversion on every argument that' s being passed (see Table 32-1).
es: To work around this, you have to use a set of API functions to force a type conversion on every argument that' s being passed (see Tabla 32-1).

source: Table 32-1.
es: Tabla 32-1.

source: Figure 32-2 shows the output.
es: Figura 32-2 shows the output.

source: Figure 32-2.
es: Figura 32-2.

source: Example 32-2.
es: Ejemplo 32-2.

source: For a description of both structures, see Table 32-2, Table 32-3 and Table 32-4.
es: For a description of both structures, see Tabla 32-2, Tabla 32-3 and Tabla 32-4.

source: Table 32-2.
es: Tabla 32-2.

source: See Table 32-3 for a description.
es: See Tabla 32-3 for a description.

source: For a list of available types, see Table 32-4.
es: For a list of available types, see Tabla 32-4.

source: Table 32-3.
es: Tabla 32-3.

source: Table 32-4.
es: Tabla 32-4.

source: Examples are given in in Example 32-3.
es: Examples are given in in Ejemplo 32-3.

source: Example 32-3.
es: Ejemplo 32-3.

source: Figure 32-1.
es: Figura 32-1.

source: A very clever implementation of this can be found in the code handling PHP' s fsockopen() located in ext / standard / fsock.c, as shown in Example 32-1.
es: A very clever implementation of this can be found in the code handling PHP' s fsockopen() located in ext / standard / fsock.c, as shown in Ejemplo 32-1.

source: Example 32-1.
es: Ejemplo 32-1.

source: The default config.m4 shown in Example 27-1 is a bit more complex:
es: The default config.m4 shown in Ejemplo 27-1 is a bit more complex:

source: Example 27-1.
es: Ejemplo 27-1.

source: Example 38-1 shows a small demonstration of calling a user function.
es: Ejemplo 38-1 shows a small demonstration of calling a user function.

source: Example 38-1.
es: Ejemplo 38-1.

source: PHP defines a set of macros that can be used in this process, the most useful of which are described in Table 41-1.
es: PHP defines a set of macros that can be used in this process, the most useful of which are described in Tabla 41-1.

source: Table 41-1.
es: Tabla 41-1.

source: Example 28-1 shows the source.
es: Ejemplo 28-1 shows the source.

source: Example 28-1.
es: Ejemplo 28-1.

source: The module shown earlier in Example 28-1 can be enabled with --enable-first_module or --enable-first_module=yes.
es: The module shown earlier in Ejemplo 28-1 can be enabled with --enable-first_module or --enable-first_module=yes.

source: readgzfile
es: Siguiente

source: Access to initialization entries can also be handled with the macros shown in Table 39-1.
es: Access to initialization entries can also be handled with the macros shown in Tabla 39-1.

source: Table 39-1.
es: Tabla 39-1.

source: Chapter 26.
es: Capítulo 26.

source: This might sound a bit confusing at first, but it' s not that complicated (see Figure 24-1).
es: This might sound a bit confusing at first, but it' s not that complicated (see Figura 24-1).

source: Figure 24-1.
es: Figura 24-1.

source: Chapter 25.
es: Capítulo 25.

source: As shown in Figure 24-1 As shown in Figure 24-1 above, PHP can be extended primarily at three points: external modules, built-in modules, and the Zend engine.
es: As shown in Figura 24-1 As shown in Figura 24-1 above, PHP can be extended primarily at three points: external modules, built-in modules, and the Zend engine.

source: Chapter 36.
es: Capítulo 36.

source: For examples of these functions, see Example 36-2.
es: For examples of these functions, see Ejemplo 36-2.

source: Example 36-2.
es: Ejemplo 36-2.

source: Example 36-1 Example 36-1 shows a source example and its output.
es: Ejemplo 36-1 Ejemplo 36-1 shows a source example and its output.

source: Example 36-1.
es: Ejemplo 36-1.

source: Table 36-1.
es: Tabla 36-1.

source: Figure 36-1.
es: Figura 36-1.

source: These macros automatically set the correspondent type and value, as described in Table 35-1 and Table 35-2.
es: These macros automatically set the correspondent type and value, as described in Tabla 35-1 and Tabla 35-2.

source: The macros in Table 35-1 automatically return from your function, those in Table 35-2 only set the return value; they don't return from your function.
es: The macros in Tabla 35-1 automatically return from your function, those in Tabla 35-2 only set the return value; they don 't return from your function.

source: Table 35-1.
es: Tabla 35-1.

source: Table 35-2.
es: Tabla 35-2.

source: Chapter 31.
es: Capítulo 31.

source: The parameter list of this declaration is very important; you should keep these parameters in mind (see Table 31-1 for descriptions).
es: The parameter list of this declaration is very important; you should keep these parameters in mind (see Tabla 31-1 for descriptions).

source: Table 31-1.
es: Tabla 31-1.

source: Internally, zend_function_entry is defined as shown in Example 31-1.
es: Internally, zend_function_entry is defined as shown in Ejemplo 31-1.

source: Example 31-1.
es: Ejemplo 31-1.

source: Table 31-2 shows a list of all the macros that you can use to define functions.
es: Tabla 31-2 shows a list of all the macros that you can use to define functions.

source: Table 31-2.
es: Tabla 31-2.

source: You can see the internal definition of this module in Example 31-2.
es: You can see the internal definition of this module in Ejemplo 31-2.

source: Example 31-2.
es: Ejemplo 31-2.

source: For reference purposes, you can find a list of the macros involved in declared startup and shutdown functions in Table 31-3.
es: For reference purposes, you can find a list of the macros involved in declared startup and shutdown functions in Tabla 31-3.

source: Table 31-3.
es: Tabla 31-3.

source: For a simple test procedure, you can copy it to your htdocs directory and try it with the source in Example 29-1.
es: For a simple test procedure, you can copy it to your htdocs directory and try it with the source in Ejemplo 29-1.

source: Example 29-1.
es: Ejemplo 29-1.

source: Calling this PHP file in your Web browser should give you the output shown in Figure 29-1.
es: Calling this PHP file in your Web browser should give you the output shown in Figura 29-1.

source: Figure 29-1.
es: Figura 29-1.

source: Chapter 33.
es: Capítulo 33.

source: Table 33-1, Table 33-2 and Table 33-3 describe these functions.
es: Tabla 33-1, Tabla 33-2 and Tabla 33-3 describe these functions.

source: Table 33-1.
es: Tabla 33-1.

source: Table 33-2.
es: Tabla 33-2.

source: Table 33-3.
es: Tabla 33-3.

source: This is done using zend_hash_update( )() for associative arrays (see Example 33-3) and zend_hash_index_update() for indexed arrays (see Example 33-4):
es: This is done using zend_hash_update( )() for associative arrays (see Ejemplo 33-3) and zend_hash_index_update() for indexed arrays (see Ejemplo 33-4):

source: Example 33-3.
es: Ejemplo 33-3.

source: Example 33-4.
es: Ejemplo 33-4.

source: To create your own constants, you can use the macros in Table 33-6.
es: To create your own constants, you can use the macros in Tabla 33-6.

source: Table 33-6.
es: Tabla 33-6.

source: This is somewhat bad practice, but Table Table 33-5 describes macros that do exactly this task.
es: This is somewhat bad practice, but Table Tabla 33-5 describes macros that do exactly this task.

source: Table 33-5.
es: Tabla 33-5.

source: Example 33-1.
es: Ejemplo 33-1.

source: The corresponding type value for longs is IS_LONG (see Example 33-2).
es: The corresponding type value for longs is IS_LONG (see Ejemplo 33-2).

source: Example 33-2.
es: Ejemplo 33-2.

source: Table 33-4.
es: Tabla 33-4.
